{
  "backend/main.mo": "Motoko actor defining types and in‑memory maps for notices, events, gallery items, memberships, payments, contacts, and user profiles with admin authorization logic and ID counters.",
  "feature_evidence.json": "Feature evidence report mapping features to involved files, components, and test IDs for notice/event mutation hooks and admin edit UI.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend files including pages, components, and hooks.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and applying global background, text, and border styles.",
  "frontend/index.html": "Base HTML template loading fonts and mounting the React app entrypoint.",
  "frontend/src/App.tsx": "Sets up the TanStack Router route tree and renders all application pages within the SiteLayout.",
  "frontend/src/components/AuthControl.tsx": "Authentication control handling Internet Identity login/logout and triggering React Query cache resets and admin check invalidation.",
  "frontend/src/components/forms/ContactForm.tsx": "Implements a contact form with validation, submission via a query hook, and displays success or error alerts.",
  "frontend/src/components/forms/MembershipForm.tsx": "Provides a membership registration form with validation, submission to backend, and status alerts.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Creates a modal lightbox for viewing gallery images with navigation buttons and keyboard controls.",
  "frontend/src/components/gallery/ImageWithFallback.tsx": "Renders an image component that swaps to a fallback URL if loading the primary source fails.",
  "frontend/src/components/payments/PaymentsSection.tsx": "Displays payment option cards for maintenance fees and welfare contributions with placeholder buttons.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying association info, navigation links, contact details, and Caffeine.ai attribution.",
  "frontend/src/components/SiteHeader.tsx": "Header with navigation, conditional admin link, mobile menu, and authentication controls with admin check error indicator.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main site layout with header, footer, and routed page content via Outlet.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin checks, notices, events, and gallery CRUD operations using an actor backend.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines custom NCRL color variables and utility classes for light and dark themes.",
  "frontend/src/lib/adminLinks.ts": "Provides helpers to normalize admin tab names and generate admin navigation URLs.",
  "frontend/src/lib/events.ts": "Maps event types to human-readable labels.",
  "frontend/src/lib/gallery.ts": "Utilities for validating, normalizing, sorting, and providing fallback gallery items.",
  "frontend/src/lib/notices.ts": "Maps notice categories to descriptive labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, committee info, and styled UI components.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin dashboard with authentication, tab navigation, profile setup, and CRUD interactions via React Query hooks.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information with loading skeletons and a contact form, using fetched data or fallbacks.",
  "frontend/src/pages/DocumentsPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/EventsPage.tsx": "Shows upcoming and past events, handles loading and errors, and conditionally displays admin controls.",
  "frontend/src/pages/GalleryPage.tsx": "Loads and displays a gallery grid with admin controls, skeletons, error states, and a lightbox viewer.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring hero section, quick links, previews for notices, events, gallery, and contact info.",
  "frontend/src/pages/MembershipPaymentsPage.tsx": "Renders membership registration and payment sections within card layouts.",
  "frontend/src/pages/NoticesPage.tsx": "Lists notices with category filtering, admin options, and loading/error handling.",
  "frontend/src/utils/backendErrors.ts": "Utility that converts backend error messages into user-friendly text based on common patterns.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL parameters, persist them in sessionStorage, and manage hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "JSON describing the project’s current state, admin-gated feature requirements, known issues, and pending update requests."
}