{
  "backend/main.mo": "Defines the main canister actor with data types, maps, IDs, default gallery items, access control, and query methods for user profiles.",
  "backend/migration.mo": "Provides a migration module that mirrors actor state types and returns the previous state unchanged.",
  "feature_evidence.json": "Specifies feature evidence for adding image file upload support in the gallery admin UI, listing affected files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files for documentation or build tooling.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH color tokens for light and dark themes with global styling rules.",
  "frontend/index.html": "HTML entry file setting metadata, font preloads, and loading the main React script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and renders the app using SiteLayout as the root component.",
  "frontend/src/components/forms/ContactForm.tsx": "Form component using react-hook-form to submit contact messages via a mutateAsync call with success and error alerts.",
  "frontend/src/components/forms/MembershipForm.tsx": "Membership registration form handling user details and membership type submission with success and error handling.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Lightbox dialog for navigating gallery images with keyboard and on-screen controls.",
  "frontend/src/components/payments/PaymentsSection.tsx": "Displays payment option cards for maintenance fees and welfare contributions with placeholder buttons.",
  "frontend/src/components/SiteFooter.tsx": "Footer showing association details, quick links, contact info, and caffeine.ai attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive navigation header with desktop links and a mobile sheet menu highlighting the active route.",
  "frontend/src/components/SiteLayout.tsx": "Wraps pages with a header, footer, and Outlet for routed content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and identity loading using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching and mutating notices, events, gallery items, contact info, admin status, and user profile via the actor.",
  "frontend/src/index.css": "Defines Tailwind layers plus custom OKLCH color variables, light/dark theme tokens, and utility classes for NCRL brand colors.",
  "frontend/src/lib/events.ts": "Maps EventType values to human-readable labels.",
  "frontend/src/lib/gallery.ts": "Provides helpers to normalize, validate, sort, and fallback gallery items, including default local items.",
  "frontend/src/lib/notices.ts": "Maps NoticeCategory values to descriptive category labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, committee info, and styled UI components.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin dashboard with authentication, profile setup, and CRUD interfaces for notices, events, and gallery items.",
  "frontend/src/pages/ContactPage.tsx": "Displays association contact info with loading skeletons and a contact form.",
  "frontend/src/pages/DocumentsPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/EventsPage.tsx": "Fetches and displays upcoming and past events with type labels and styled cards.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery with loading/error states and opens a lightbox for selected images using fetched gallery items.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, quick links, previews for notices/events/gallery, and a contact form.",
  "frontend/src/pages/MembershipPaymentsPage.tsx": "Provides membership registration and payments UI using a form and payments section inside styled cards.",
  "frontend/src/pages/NoticesPage.tsx": "Shows notices filtered by category with tabs, loading states, and cards for each notice.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL/session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project state metadata describing features, pending requests, admin access issues, and architectural notes."
}