{
  "backend/main.mo": "Main backend actor defining data models, access control, and CRUD operations for notices, events, gallery items, memberships, payments, contacts, and user profiles.",
  "backend/migration.mo": "Migration module that seeds gallery items if empty and preserves existing state while updating nextGalleryItemId.",
  "feature_evidence.json": "Feature evidence report linking an admin-access feature to its source file, components, and test reference.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS styles defining theme variables, dark mode tokens, and base element styling.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Router setup defining all app routes and wrapping them with the SiteLayout root component.",
  "frontend/src/components/forms/ContactForm.tsx": "Implements a contact form with validation, submission via useSubmitContact, and success/error alerts.",
  "frontend/src/components/forms/MembershipForm.tsx": "Provides a membership registration form with validation, membership type selection, and submission handling.",
  "frontend/src/components/gallery/GalleryLightbox.tsx": "Renders a lightbox for gallery images with navigation controls and keyboard support.",
  "frontend/src/components/payments/PaymentsSection.tsx": "Displays payment options for maintenance fees and welfare contributions with placeholder buttons.",
  "frontend/src/components/SiteFooter.tsx": "Footer component displaying association info, quick links, contact details, and Caffeine.ai attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, desktop and mobile navigation, and active route highlighting.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main site layout with header, footer, and routed content via Outlet.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, managing login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating notices, events, gallery items, contact info, and user data via the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables for light and dark themes, and custom utility classes for NCRL colors.",
  "frontend/src/lib/events.ts": "Maps event type enums to readable labels for UI display.",
  "frontend/src/lib/gallery.ts": "Provides helpers to normalize, validate, and sort gallery items for UI use.",
  "frontend/src/lib/notices.ts": "Maps notice category enums to human‑readable labels.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the association’s About page with mission, vision, and committee info.",
  "frontend/src/pages/AdminPage.tsx": "Implements admin dashboard with authentication, profile setup, and management of notices, events, and gallery items.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information and a contact form, with loading skeletons.",
  "frontend/src/pages/DocumentsPage.tsx": "Lists downloadable documents such as layout plans and association bylaws.",
  "frontend/src/pages/EventsPage.tsx": "Shows upcoming and past events using fetched data and event type labels.",
  "frontend/src/pages/GalleryPage.tsx": "Renders the gallery with loading, error, empty, and lightbox states using processed gallery items. Allows selecting images to view in a lightbox.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero section, quick links, and previews of notices, events, contact info, and gallery items. Loads multiple data sources and displays a small gallery preview.",
  "frontend/src/pages/MembershipPaymentsPage.tsx": "Displays membership registration and payment sections using a form and payments component. Provides a simple layout for joining and contributing.",
  "frontend/src/pages/NoticesPage.tsx": "Shows notices filtered by category with tabs and loading, empty, and populated states. Fetches notices dynamically based on the selected category.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including support for hash-based routing. Provides persistence helpers for parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and container settings. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project state, pending feature requests, and known issues related to gallery seeding, persistence, and admin access. Tracks schema and project metadata."
}