{
  "kind": "build_request",
  "title": "Grant admin access to provided Principal and add gallery image upload for Notices/Events management",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Grant admin permissions to the Internet Identity Principal `bivov-zoivv-elizs-vxwob-drkj7-3idkg-ay4cf-tugyq-vy2rd-oretd-vae` so this user can access the existing Admin Dashboard and manage Notices, Events, and Gallery items.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I want to upload image and notices and events \nPrincipal id:\nbivov-zoivv-elizs-vxwob-drkj7-3idkg-ay4cf-tugyq-vy2rd-oretd-vae"
        ]
      },
      "acceptanceCriteria": [
        "When logged in with Internet Identity Principal `bivov-zoivv-elizs-vxwob-drkj7-3idkg-ay4cf-tugyq-vy2rd-oretd-vae`, the /admin page no longer shows the \"Access Denied\" card and instead renders the Admin Dashboard tabs.",
        "The Principal can successfully create and delete notices via createNotice/deleteNotice without receiving an \"Unauthorized\" trap.",
        "The Principal can successfully create and delete events via createEvent/deleteEvent without receiving an \"Unauthorized\" trap.",
        "The Principal can successfully add and delete gallery items via addGalleryItem/deleteGalleryItem without receiving an \"Unauthorized\" trap."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an image file upload option in the Admin Dashboard Gallery management UI so admins can choose a local image file and have it saved as the gallery item image (store the image in the existing `imageUrl` field using a Data URL string, with basic client-side validation and clear English error messages).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I want to upload image and notices and events"
        ]
      },
      "acceptanceCriteria": [
        "In the Admin Dashboard > Gallery tab, the add-gallery-item form includes a file input (accepting common image types like PNG/JPG/WebP).",
        "When an admin selects an image file, the UI converts it to a Data URL and uses it as the `imageUrl` when calling addGalleryItem, without requiring the admin to manually paste a URL.",
        "If the selected file is not an image or exceeds a reasonable size limit, the UI blocks submission and shows an English error message explaining why.",
        "After adding a gallery item with an uploaded image, the Gallery page displays the new item and renders the uploaded image correctly using the stored Data URL."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit any frontend files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing external image hosting or third-party storage integrations.",
    "Adding non-Internet-Identity authentication methods.",
    "Building a separate public-facing content submission workflow for non-admin users."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}