{
  "kind": "build_request",
  "title": "Seed gallery with temporary placeholder images and unblock admin access",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Automatically seed the Gallery with a small set of temporary placeholder images when the canister is deployed/upgraded and the gallery is currently empty, so the public Gallery page no longer shows an empty state. The seeded items must be removable later via the existing admin delete functionality.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-11"
        ],
        "quotes": [
          "add some random pics for now. which I can delete later using admin priviledges",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh deployment (or after an upgrade) where `getGalleryItems()` would otherwise return an empty list, the canister creates a fixed number of placeholder `GalleryItem`s automatically.",
        "The placeholder items include non-empty `title`, `imageUrl`, and `description` fields and render correctly in the existing Gallery UI without frontend code changes.",
        "Seeding is idempotent: it does not create duplicates on subsequent upgrades/runs if the gallery is already non-empty.",
        "Seeded placeholder items can be deleted using the existing `deleteGalleryItem` admin mutation once admin access is available."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix data persistence for Gallery items so that gallery content (including the placeholder seed items and any future uploads) is retained across canister upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "No gallery images available at the moment.\n\nCheck back later for photos of community events and activities.",
          "It simply means your gallery currently has no photos stored for that section. Once images are uploaded again (for example, the Bengaluru event photos), they will appear automatically."
        ]
      },
      "acceptanceCriteria": [
        "After deploying an upgrade, `getGalleryItems()` returns the same items that existed before the upgrade (no data loss).",
        "`nextGalleryItemId` (or equivalent ID allocator) continues from the correct value after upgrade, avoiding ID collisions.",
        "If a state migration is required, it is implemented via `backend/migration.mo` under the project’s conditional migration policy."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Unblock admin access management by exposing the logged-in Internet Identity Principal ID in the Admin Access Denied screen and/or Admin page header so an existing administrator can grant permissions for that Principal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Access Denied\nYou do not have permission to access the admin dashboard. Please contact an administrator if you believe this is an error."
        ]
      },
      "acceptanceCriteria": [
        "When a logged-in user is not an admin, the Access Denied UI displays their Principal ID in a copyable format (e.g., a monospace text field with a Copy button).",
        "All user-facing text for this feature is in English.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Provide a clear backend-side path to restore/assign admin privileges for a Principal when no working admin is available (to resolve the current “Access Denied” dead-end).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-7"
        ],
        "quotes": [
          "Access Denied\nYou do not have permission to access the admin dashboard. Please contact an administrator if you believe this is an error.",
          "add some random pics for now. which I can delete later using admin priviledges"
        ]
      },
      "acceptanceCriteria": [
        "There is a documented, deterministic mechanism to bootstrap admin access after deployment (e.g., a one-time initialization rule when no admins exist, or an explicitly callable bootstrap method guarded by a safe condition).",
        "Once the user’s Principal is granted admin, `isCallerAdmin()` returns true for that Principal and the Admin dashboard loads successfully.",
        "The solution does not require external services or third-party authentication beyond Internet Identity."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Only generate/modify `backend/migration.mo` if needed to preserve existing state during upgrades (conditional migration policy).",
    "Do not edit any frontend files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx`.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Re-uploading or recreating the original Bengaluru event photo set (not provided in this request).",
    "Adding third-party storage, databases, or external admin/auth providers.",
    "Building a real-time gallery upload pipeline or integrating external image hosting APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}