{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin edit/update workflow for notices and events (frontend)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add React Query update mutations for notices/events and ensure invalidation refreshes notices and both upcoming/past event lists after any write operation.",
      "acceptanceCriteria": [
        "`useQueries.ts` includes `useUpdateNotice` and `useUpdateEvent` hooks that call the new backend update APIs and normalize backend errors using the existing `normalizeBackendError` helper",
        "After a notice is created/updated/deleted, the notices list shown in the UI refreshes without a full page reload",
        "After an event is created/updated/deleted, both Upcoming and Past event lists refresh correctly (i.e., invalidation targets the actual query keys used for `useUpcomingEvents` and `usePastEvents`)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add `useUpdateNotice` and `useUpdateEvent` React Query mutation hooks calling `actor.updateNotice` / `actor.updateEvent` and throwing normalized errors via `normalizeBackendError`. Update existing event create/delete invalidation to explicitly invalidate the query keys used by `useUpcomingEvents` (['events','upcoming']) and `usePastEvents` (['events','past']), and ensure notice create/delete + new update mutations invalidate ['notices'] so UI refreshes without reload."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add admin UI Edit actions for notices and events with pre-filled dialogs, saving via update mutations and showing English success/error toasts.",
      "acceptanceCriteria": [
        "In Admin page notice management, each existing notice row has an Edit control that opens a dialog with fields pre-populated from the selected notice",
        "Saving an edited notice updates the backend, closes the dialog, shows a success toast, and the notices table reflects the updated values",
        "In Admin page event management, each existing event row has an Edit control that opens a dialog with fields pre-populated from the selected event (including isPast)",
        "Saving an edited event updates the backend, closes the dialog, shows a success toast, and the events table reflects the updated values; if isPast changes, the event appears in the correct list (Upcoming vs Past) after refresh",
        "User-facing text for edit/update flows is in English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Implement edit/update workflow in the Admin notices and events management tables: add an Edit action per row that opens a pre-filled dialog, allows updating category/title/content/date for notices and eventType/title/description/date/isPast for events, and saves via new update mutation hooks with success/error toasts (English). Use existing shadcn/ui components (e.g., Dialog, Button, Input, Textarea, Select, Table; and a boolean control like Checkbox/Switch if already available) to build the dialogs—do not edit any files under `frontend/src/components/ui`. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Wire the AdminPage edit dialogs to the new `useUpdateNotice` and `useUpdateEvent` hooks, ensuring their onSuccess invalidation triggers a refresh so updated rows/lists reflect changes (including moving an event between Upcoming and Past when `isPast` changes)."
        }
      ]
    }
  ]
}